export const violation_list = [
    '無',
    '21條1項1款',
    '21條1項2款',
    '21條1項4款',
    '21條1項5款',
    '21-1條1項1款',
    '21-1條1項2款',
    '21-1條1項3款',
    '21-1條1項4款',
    '21-1條1項5款',
    '21-1條1項7款',
    '22條1項4款',
    '22條1項5款',
    '22條1項6款',
    '22條2項',
    '21條1項9款',
    '無'
]

export const violation_again_list = [
    '無',
    '21條2項（五年內二次以上）',
    '21條2項（五年內二次以上）',
    '21條2項（五年內二次以上）',
    '21條2項（五年內二次以上）',
    '21-1條2項（五年內二次以上）',
    '21-1條2項（五年內二次以上）',
    '21-1條2項（五年內二次以上）',
    '21-1條2項（五年內二次以上）',
    '21-1條2項（五年內二次以上）',
    '21-1條2項（五年內二次以上）',
    '22條1項4款',
    '22條1項5款',
    '22條1項6款',
    '22條2項',
    '21條2項（五年內二次以上）',
    '無'
]

export const violation_text = [
    '合格駕駛，無違規',
    '未領有駕駛執照駕駛小型車或機車。',
    '領有機車駕駛執照，駕駛小型車。',
    '駕駛執照業經吊銷、註銷仍駕駛小型車或機車。',
    '駕駛執照吊扣期間駕駛小型車或機車。',
    '未領有駕駛執照駕駛聯結車、大客車或大貨車。',
    '領有機車駕駛執照駕駛聯結車、大客車或大貨車。',
    '領有小型車駕駛執照駕駛聯結車、大客車或大貨車。',
    '領有大貨車駕駛執照，駕駛大客車、聯結車或持大客車駕駛執照，駕駛聯結車。',
    '駕駛執照業經吊銷、註銷仍駕駛聯結車、大客車或大貨車。',
    '駕駛執照吊扣期間駕駛聯結車、大客車或大貨車。',
    '領有聯結車、大客車、大貨車或小型車駕駛執照，駕駛普通重型機車。',
    '領有聯結車、大客車、大貨車或小型車駕駛執照，駕駛輕型機車。但112年06月30日前已取得該汽車駕駛執照者，不在此限。',
    '領有輕型機車駕駛執照，駕駛普通重型機車。',
    '汽車駕駛人領有聯結車、大客車、大貨車、小型車、普通重型或輕型機車駕駛執照，駕駛大型重型機車。',
    '其他未依駕駛執照之持照條件規定駕車',
    '無處罰規定'
]

export const violation_code = [
    1,4,3,0,0,0,4,4,3,0,0,0,3,4,3,0,0,0,12,4,3,0,0,0,12,4,3,0,0,0,12,4,3,0,0,0,12,4,3,
    0,0,0,1,4,3,13,0,0,4,4,3,13,0,0,3,4,3,13,0,0,11,4,3,13,0,0,11,4,3,13,0,0,11,4,3,13,
    0,0,11,4,3,13,0,0,1,4,3,14,14,0,4,4,3,14,14,0,3,4,3,14,14,0,14,4,3,14,14,0,14,4,3,
    14,14,0,14,4,3,14,14,0,14,4,3,14,14,0,1,4,3,2,2,2,4,4,4,4,4,4,3,3,3,3,3,3,0,0,0,0,
    0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,5,10,9,6,6,6,10,10,10,10,10,10,9,9,9,9,9,9,
    7,7,7,7,7,7,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,5,10,9,6,6,6,10,10,10,10,10,10,9,9,
    9,9,9,9,7,7,7,7,7,7,8,8,8,8,8,8,0,0,0,0,0,0,0,0,0,0,0,0,5,10,9,6,6,6,10,10,10,10,10,
    10,9,9,9,9,9,9,7,7,7,7,7,7,8,8,8,8,8,8,8,8,8,8,8,8,0,0,0,0,0,0,15,15,15,15,15,15,15,
    15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,0,0,0,0,0,0,0,0,
    0,0,0,0
]

